#จุฑามาศ​ สงึมรัมย์

"""
การเขียนโปรแกรม
1.การเขียนโปรแกรมแบบลำดับขั้น
    การทำงานทีละบรรทัด
2.การเขียนโปรแกรมแบบตัดสินใจ
    การทำงานโดยมีเงื่อนไข if-else 
3.การเขียนโปรแกรมแบบวนซ้ำ
    การทำงานแบบวนซ้ำไปเรื่อยๆจนเข้าเงื่อนไขที่กำหนด
    for , while
"""
#for
"""
for ตัวแปร in range(ค่าเริ่มต้น,ค่าสิ้นสุด-1,เพิ่มค่า)
    ค่าที่ต้องการให้ทำซ้ำ


for i in range(1,11,3):
    print(i)

#โปรแกรมสูตรคูณ แม่ 5 โดยใช้ for 
for i in range(1,13,1):
	print("5 x",i,"=",5*i)
"""

#โปรแกรมสูตรคูณที่ต้องการ โดยใช้ for
a=input("กรุณาระบุแม่สูตรคูณที่ต้องการ :")
a=int(a)
print("สูตรคูณแม่",a)
for i in range(1,13,1):
	print(a,"x",i,"=",a*i)
	
#----------------------------------------