#จุฑามาศ สงึมรัมย์ ธด.3/1 รหัส 000

"""
ตัวดำเนินการเปรียบเทียบ
== เท่ากับ
!= ไม่เท่ากับ
>  มากกว่า
>= มากกว่าเท่ากับ
<  น้อยกว่า
<= น้อยกว่าเท่ากับ

"""

#x = 5
#y = 6
"""print("โปรแกรมเปรียบเทียบค่า 2 ค่า")
x = input("กรุณาใส่ค่า x :")
y = input("กรุณาใส่ค่า y :")

print("x=y",x==y)
print("x!=y",x!=y)
print("x>y",x>y)
print("x>=y",x>=y)
print("x<y",x<y)
print("x<=y",x<=y)"""

#----------------------------------------
"""
if....else

if คำสั่งที่เป็นจริง : #เป็นจริง
    คำสั่ง
else :           #เป็นเท็จ
    คำสั่ง

"""
#x = 50
#y = 20

"""x = input("กรุณาใส่ค่า x :")
x = int(x)
y = input("กรุณาใส่ค่า y :")
y = int(y)

if x<y :
    print("x มีค่าน้อยกว่า y")
elif x>y :
    print("x มีค่ามากกว่า y")
else :
    print("x มีค่าเท่ากับ y")"""

"""a = input("กรุณาใส่ค่า a :")
b = input("กรุณาใส่ค่า b :")
a = int(a)
b = int(b)

if a>b : 
    print("a มีค่ามากกว่ากว่า b")
elif a<b :
    print("a มีค่าน้อยกว่ากว่า b")
elif a==b :
    print("a มีค่าเท่ากับกว่า b")
else :
    print("ท่านหรอกข้อมูลผิด")"""

#-------------------------------------

print("โปรแกรมคำนวณค่า BMI (ดัชนีมวลกาย)")
w = input("ป้อนน้ำหนักของคุณ (kg) :")
h = input("ป้อนส่วนสูงของคุณ (cm) :")
w = int(w)
h = int(h)
h = h/100
BMI = w/(h*h)

if BMI<18.5 :
    a = "คุณน้ำหนักน้อย"
elif BMI>=18.5 and BMI<=22.9 :
    a = "คุณน้ำหนักปกติ"
elif BMI>=23 and BMI<=24.9 :
    a = "คุณน้ำหนักเกิน"
elif BMI>=25 and BMI<=29.9 :
    a = "คุณเป็นโรคอ้วน"
elif BMI>=30:
    a = "คุณอ้วนมาก"
else :
    a = "คุณกรอกข้อมูลผิด"

print("ค่า BMI ของคุณคือ",'%.2f'%(BMI),a)