#จุฑามาศ สงึมรัมย์ ธด.3/1 รหัส 000
"""
ตัวดำเนินการทางคณิตศาสตร์
+   บวก
-   ลบ
*   คูณ
/   หาร 3.14
//  หารเอาแค่เลขตัวหน้า 3
%   หารเอาเศษ 14
**  ยกกำลัง 2 ยกกำลัง 5 >> 2**5 = 32

"""

#x = 5
#y = 10
#จุฑามาศ สงึมรัมย์ ธด.3/1 รหัส 000

"""x = input("กรุณาใส่ค่า x : ")
y = input("กรุณาใส่ค่า y : ")
x = int(x)
y = int(y)

print("x+y =",x+y) #บวก
print(type(x+y))
print("x-y =",x-y) #ลบ
print(type(x-y))
print("x*y =",x*y) #คูณ
print(type(x*y))
print("x/y =",x/y) #หาร
print(type(x/y))
print("x//y =",x//y) #หารเอาแค่เลขตัวหน้า
print(type(x//y))
print("x%y =",x%y) #หารเอาเศษ
print(type(x%y))
print("x**y =",x**y) #ยกกำลัง
print(type(x**y))"""

print("โปรแกรมคำนวณพื้นที่สามเหลี่ยมด้านเท่า")
h = input("กรุณากรอกความสูง : ")
h = int(h)

print(h)